{"backend": "tensorflow", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["conv2d_19", 0, 0]], "layers": [{"name": "input_1", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "sparse": false, "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "conv2d_1", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 8, "name": "conv2d_1", "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv2d_2", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 8, "name": "conv2d_2", "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "config": {"trainable": true, "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "conv2d_3", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 16, "name": "conv2d_3", "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "conv2d_4", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 16, "name": "conv2d_4", "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "config": {"trainable": true, "name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "conv2d_5", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 32, "name": "conv2d_5", "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_6", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 32, "name": "conv2d_6", "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "config": {"trainable": true, "name": "max_pooling2d_3", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "conv2d_7", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 64, "name": "conv2d_7", "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"name": "conv2d_8", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 64, "name": "conv2d_8", "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "max_pooling2d_4", "config": {"trainable": true, "name": "max_pooling2d_4", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "conv2d_9", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 128, "name": "conv2d_9", "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"name": "conv2d_10", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 128, "name": "conv2d_10", "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "conv2d_transpose_1", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 64, "name": "conv2d_transpose_1", "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [2, 2]}, "class_name": "Conv2DTranspose", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "concatenate_1", "config": {"trainable": true, "name": "concatenate_1", "axis": 3}, "class_name": "Concatenate", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}], ["conv2d_8", 0, 0, {}]]]}, {"name": "conv2d_11", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 64, "name": "conv2d_11", "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "conv2d_12", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 64, "name": "conv2d_12", "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "conv2d_transpose_2", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 32, "name": "conv2d_transpose_2", "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [2, 2]}, "class_name": "Conv2DTranspose", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "concatenate_2", "config": {"trainable": true, "name": "concatenate_2", "axis": 3}, "class_name": "Concatenate", "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}], ["conv2d_6", 0, 0, {}]]]}, {"name": "conv2d_13", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 32, "name": "conv2d_13", "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"name": "conv2d_14", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 32, "name": "conv2d_14", "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"name": "conv2d_transpose_3", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 16, "name": "conv2d_transpose_3", "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [2, 2]}, "class_name": "Conv2DTranspose", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"name": "concatenate_3", "config": {"trainable": true, "name": "concatenate_3", "axis": 3}, "class_name": "Concatenate", "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}], ["conv2d_4", 0, 0, {}]]]}, {"name": "conv2d_15", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 16, "name": "conv2d_15", "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"name": "conv2d_16", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 16, "name": "conv2d_16", "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "conv2d_transpose_4", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 8, "name": "conv2d_transpose_4", "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [2, 2]}, "class_name": "Conv2DTranspose", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"name": "concatenate_4", "config": {"trainable": true, "name": "concatenate_4", "axis": 3}, "class_name": "Concatenate", "inbound_nodes": [[["conv2d_transpose_4", 0, 0, {}], ["conv2d_2", 0, 0, {}]]]}, {"name": "conv2d_17", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 8, "name": "conv2d_17", "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"name": "conv2d_18", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 8, "name": "conv2d_18", "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "conv2d_19", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 1, "name": "conv2d_19", "kernel_regularizer": null, "padding": "valid", "bias_constraint": null, "dilation_rate": [1, 1], "activation": "sigmoid", "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}]}, "keras_version": "2.1.6"}